package keywords;

public enum JobCategoryCode {
	
	JCCALL(Integer.MIN_VALUE, "전체"),
	JCC1(101,"기획·전략·경영"),
	JCC2(102,"총무·법무·사무"),
	JCC3(103,"경리·출납·결산"),
	JCC4(104,"홍보·PR·사보"),
	JCC5(107,"비서·안내·수행원"),
	JCC6(108,"사무보조·문서작성"),
	JCC7(113,"인사·교육·노무"),
	JCC8(114,"회계·재무·세무·IR"),
	JCC9(119,"마케팅·광고·분석"),
	JCC10(120,"전시·컨벤션·세미나"),
	JCC11(202,"일반영업"),
	JCC12(203,"판매·매장관리"),
	JCC13(205,"IT·솔루션영업"),
	JCC14(206,"금융·보험영업"),
	JCC15(207,"광고영업"),
	JCC16(208,"기술영업"),
	JCC17(209,"영업기획·관리·지원"),
	JCC18(210,"TM·아웃바운드"),
	JCC19(211,"TM·인바운드"),
	JCC20(212,"고객센터·CS"),
	JCC21(213,"QA·CS강사·수퍼바이저"),
	JCC22(301,"금속·금형"),
	JCC23(302,"기계·기계설비"),
	JCC24(303,"화학·에너지"),
	JCC25(304,"섬유·의류·패션"),
	JCC26(308,"전기·전자·제어"),
	JCC27(309,"생산관리·품질관리"),
	JCC28(314,"반도체·디스플레이·LCD"),
	JCC29(315,"생산·제조·포장·조립"),
	JCC30(316,"비금속·요업·신소재"),
	JCC31(317,"바이오·제약·식품"),
	JCC32(318,"설계·CAD·CAM"),
	JCC33(319,"안경·렌즈·광학"),
	JCC34(401,"웹마스터·QA·테스터"),
	JCC35(402,"서버·네트워크·보안"),
	JCC36(403,"웹기획·PM"),
	JCC37(404,"웹개발"),
	JCC38(405,"게임·Game"),
	JCC39(406,"컨텐츠·사이트운영"),
	JCC40(407,"응용프로그램개발"),
	JCC41(408,"시스템개발"),
	JCC42(409,"ERP·시스템분석·설계"),
	JCC43(410,"통신·모바일"),
	JCC44(411,"하드웨어·소프트웨어"),
	JCC45(412,"웹디자인"),
	JCC46(413,"퍼블리싱·UI개발"),
	JCC47(414,"동영상·편집·코덱"),
	JCC48(415,"IT·디자인·컴퓨터교육"),
	JCC49(416,"데이터베이스·DBA"),
	JCC50(417,"인공지능(AI)·빅데이터"),
	JCC51(501,"경영분석·컨설턴트"),
	JCC52(502,"증권·투자·펀드·외환"),
	JCC53(504,"헤드헌팅·노무·직업상담"),
	JCC54(505,"설문·통계·리서치"),
	JCC55(509,"외국어·번역·통역"),
	JCC56(510,"법률·특허·상표"),
	JCC57(511,"세무·회계·CPA"),
	JCC58(512,"채권·보험·보상·심사"),
	JCC59(513,"도서관사서"),
	JCC60(518,"연구소·R&D"),
	JCC61(522,"문화·예술·종교"),
	JCC62(523,"특수직"),
	JCC63(524,"임원·CEO"),
	JCC64(601,"교육기획·교재"),
	JCC65(602,"초중고·특수학교"),
	JCC66(603,"학습지·과외·방문"),
	JCC67(604,"유치원·보육"),
	JCC68(605,"전문직업·IT강사"),
	JCC69(606,"입시·보습·속셈학원"),
	JCC70(609,"학원관리·운영·상담"),
	JCC71(610,"대학교수·행정직"),
	JCC72(611,"외국어·어학원"),
	JCC73(702,"연예·엔터테인먼트"),
	JCC74(703,"카메라·조명·미술"),
	JCC75(704,"공연·무대·스텝"),
	JCC76(705,"작가·시나리오"),
	JCC77(708,"영화제작·배급"),
	JCC78(709,"광고·카피·CF"),
	JCC79(710,"기자"),
	JCC80(711,"방송연출·PD·감독"),
	JCC81(712,"진행·아나운서"),
	JCC82(713,"음악·음향·사운드"),
	JCC83(714,"인쇄·출판·편집"),
	JCC84(715,"사진·포토그라퍼"),
	JCC85(807,"중장년·고령인·실버"),
	JCC86(808,"장애인·국가유공자"),
	JCC87(809,"병역특례"),
	JCC88(810,"공무원"),
	JCC89(812,"사회복지·요양·봉사"),
	JCC90(813,"장교·군인·부사관"),
	JCC91(901,"토목·조경·도시·측량"),
	JCC92(902,"건축·인테리어·설계"),
	JCC93(903,"전기·소방·통신·설비"),
	JCC94(904,"환경·플랜트"),
	JCC95(905,"현장·시공·감리·공무"),
	JCC96(906,"안전·품질·검사·관리"),
	JCC97(908,"부동산·개발·경매·분양"),
	JCC98(909,"본사·관리·전산"),
	JCC99(1001,"물류·유통·운송"),
	JCC100(1002,"해외영업·무역영업"),
	JCC101(1003,"구매·자재·재고"),
	JCC102(1004,"납품·배송·택배"),
	JCC103(1005,"상품기획·MD"),
	JCC104(1006,"무역사무·수출입"),
	JCC105(1007,"운전·기사"),
	JCC106(1008,"중장비·화물"),
	JCC107(1101,"웨딩·행사·이벤트"),
	JCC108(1102,"안내·도우미·나레이터"),
	JCC109(1103,"보안·경호·안전"),
	JCC110(1104,"주차·세차·주유"),
	JCC111(1105,"AS·서비스·수리"),
	JCC112(1107,"외식·식음료"),
	JCC113(1108,"호텔·카지노·콘도"),
	JCC114(1109,"여행·관광·항공"),
	JCC115(1110,"레저·스포츠"),
	JCC116(1111,"미용·피부관리·애견"),
	JCC117(1112,"요리·제빵사·영양사"),
	JCC118(1113,"가사·청소·육아"),
	JCC119(1201,"그래픽디자인·CG"),
	JCC120(1202,"출판·편집디자인"),
	JCC121(1203,"제품·산업디자인"),
	JCC122(1204,"캐릭터·만화·애니"),
	JCC123(1205,"의류·패션·잡화디자인"),
	JCC124(1207,"디자인기타"),
	JCC125(1208,"전시·공간디자인"),
	JCC126(1209,"광고·시각디자인"),
	JCC127(1301,"의사·치과·한의사"),
	JCC128(1302,"수의사"),
	JCC129(1303,"약사"),
	JCC130(1304,"간호사"),
	JCC131(1305,"간호조무사"),
	JCC132(1306,"의료기사"),
	JCC133(1307,"사무·원무·코디"),
	JCC134(1308,"보험심사과"),
	JCC135(1309,"의료기타직");
	
	private int number;
	private String nameTag;
	
	JobCategoryCode(int n, String s) {
		this.number = n;
		this.nameTag = s;
	}
	
	public int returnNumberFromNameTag(String s) {
		
		for(JobCategoryCode jcc : JobCategoryCode.values()) {
			
			if(jcc.nameTag.equalsIgnoreCase(s)) {
				return jcc.number;
			}
		}
		
		return Integer.MIN_VALUE;
	}
	
	public String returnNameTagFromNumber(int n) {
		
		for(JobCategoryCode jcc : JobCategoryCode.values()) {
			
			if(jcc.number == n) {
				return jcc.nameTag;
			}
		}
		
		return null;
	}
	
	public int returnLength() {
		return JobCategoryCode.values().length;
	}
	
	public int getNumber() {
		return this.number;
	}
	
	public String getNameTag() {
		return this.nameTag;
	}
}
